In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Object Creation
Create a Series by passing list of values with default integer

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Create a DataFrame by passing NumPy array, with a datetime index and labeled columns

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.184996  1.664879  1.144055  0.442555
2013-01-02 -0.394760  0.587836 -0.920405 -0.311710
2013-01-03  1.333474 -0.572024  0.471010  0.733624
2013-01-04  1.043811  0.701500 -2.439835 -1.364444
2013-01-05 -0.190201 -1.164387  0.142973  2.074717
2013-01-06  0.544758  2.374246  0.961730 -0.507639

In [6]:
df2 = pd.DataFrame({'A': 1.,
                     'B': pd.Timestamp('20130102'),
                     'C': pd.Series(1, index= list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

The columns of the resulting DataFrame have different dtypes

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing Data
Here is how to view the top and bottom rows of the frame:

In [13]:
df.head()

                   A         B         C         D
2013-01-01  0.125785  0.171231  0.074673 -0.304952
2013-01-02  1.351675  0.062906  0.054149 -1.593760
2013-01-03  0.928863  0.973710  0.959123 -0.764992
2013-01-04  0.096706 -0.991105 -0.187535 -0.620947
2013-01-05  0.182240  0.308173 -1.098751 -1.019735

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.096706 -0.991105 -0.187535 -0.620947
2013-01-05  0.182240  0.308173 -1.098751 -1.019735
2013-01-06 -0.104063 -0.124442  0.995095  0.596275

Display the index, columns and underlying NumPy data.

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.values

array([[ 0.12578537,  0.17123081,  0.0746732 , -0.30495172],
       [ 1.35167454,  0.06290638,  0.05414916, -1.59376015],
       [ 0.92886326,  0.97370975,  0.95912255, -0.76499176],
       [ 0.09670562, -0.99110527, -0.18753495, -0.6209465 ],
       [ 0.18223967,  0.3081734 , -1.09875108, -1.0197351 ],
       [-0.1040635 , -0.12444213,  0.99509482,  0.59627459]])

describe() shows a quick statistical summary of the data.

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.430201  0.066745  0.132792 -0.618018
std    0.574211  0.639907  0.781698  0.735877
min   -0.104063 -0.991105 -1.098751 -1.593760
25%    0.103976 -0.077605 -0.127114 -0.956049
50%    0.154013  0.117069  0.064411 -0.692969
75%    0.742207  0.273938  0.738010 -0.383950
max    1.351675  0.973710  0.995095  0.596275

Transposing your data:

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.125785    1.351675    0.928863    0.096706    0.182240   -0.104063
B    0.171231    0.062906    0.973710   -0.991105    0.308173   -0.124442
C    0.074673    0.054149    0.959123   -0.187535   -1.098751    0.995095
D   -0.304952   -1.593760   -0.764992   -0.620947   -1.019735    0.596275

Sorting by an axis:

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.304952  0.074673  0.171231  0.125785
2013-01-02 -1.593760  0.054149  0.062906  1.351675
2013-01-03 -0.764992  0.959123  0.973710  0.928863
2013-01-04 -0.620947 -0.187535 -0.991105  0.096706
2013-01-05 -1.019735 -1.098751  0.308173  0.182240
2013-01-06  0.596275  0.995095 -0.124442 -0.104063

Sorting by values:

In [21]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  0.096706 -0.991105 -0.187535 -0.620947
2013-01-06 -0.104063 -0.124442  0.995095  0.596275
2013-01-02  1.351675  0.062906  0.054149 -1.593760
2013-01-01  0.125785  0.171231  0.074673 -0.304952
2013-01-05  0.182240  0.308173 -1.098751 -1.019735
2013-01-03  0.928863  0.973710  0.959123 -0.764992

# Selection

Use optimized pandas data access methods: .at, .iat, .loc and .iloc
## Getting

Selecting a single column, yeilding a Series equivalent of df.A

In [22]:
df['A']

2013-01-01    0.125785
2013-01-02    1.351675
2013-01-03    0.928863
2013-01-04    0.096706
2013-01-05    0.182240
2013-01-06   -0.104063
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  0.125785  0.171231  0.074673 -0.304952
2013-01-02  1.351675  0.062906  0.054149 -1.593760
2013-01-03  0.928863  0.973710  0.959123 -0.764992

In [25]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.351675  0.062906  0.054149 -1.593760
2013-01-03  0.928863  0.973710  0.959123 -0.764992
2013-01-04  0.096706 -0.991105 -0.187535 -0.620947

Selection by Label
For getting a cross section using a label

In [26]:
df.loc[dates[0]]

A    0.125785
B    0.171231
C    0.074673
D   -0.304952
Name: 2013-01-01 00:00:00, dtype: float64

Selecing on a multi-axis by label:

In [28]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.125785  0.171231
2013-01-02  1.351675  0.062906
2013-01-03  0.928863  0.973710
2013-01-04  0.096706 -0.991105
2013-01-05  0.182240  0.308173
2013-01-06 -0.104063 -0.124442

Showing label slicing, both endpoints are _included_

In [29]:
df.loc['20130102': '20130105', ['A', 'B']]

                   A         B
2013-01-02  1.351675  0.062906
2013-01-03  0.928863  0.973710
2013-01-04  0.096706 -0.991105
2013-01-05  0.182240  0.308173

Reduction in the dimensions of the returned object:

In [30]:
df.loc['20130102', ['A', 'B']]

A    1.351675
B    0.062906
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value:

In [52]:
df.loc[dates[0], 'A']

0.1257853727131123

For getting fast access to a scalar (eqauivalent to prior method):

In [53]:
df.at[dates[0], 'A']

0.1257853727131123

Selection by Position

Select via the position of the passed integers:

In [54]:
df.iloc[3]

A    0.096706
B   -0.991105
C   -0.187535
D   -0.620947
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python:

In [57]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.096706 -0.991105
2013-01-05  0.182240  0.308173

By lists of integer position locations, similar to numpy/python style:

In [56]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  1.351675  0.054149
2013-01-03  0.928863  0.959123
2013-01-05  0.182240 -1.098751

For slicing rows explicitly:

In [58]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.351675  0.062906  0.054149 -1.593760
2013-01-03  0.928863  0.973710  0.959123 -0.764992

For slicing columns explicitly:

In [59]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.171231  0.074673
2013-01-02  0.062906  0.054149
2013-01-03  0.973710  0.959123
2013-01-04 -0.991105 -0.187535
2013-01-05  0.308173 -1.098751
2013-01-06 -0.124442  0.995095

For getting a value explicitly:

In [60]:
df.iloc[1,1]

0.06290637691019133

For getting fast access to a scalar (equivalent to the prior method):

In [61]:
df.iat[1,1]

0.06290637691019133

# Boolean Indexing

Using a single column's values to select data

In [62]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.125785  0.171231  0.074673 -0.304952
2013-01-02  1.351675  0.062906  0.054149 -1.593760
2013-01-03  0.928863  0.973710  0.959123 -0.764992
2013-01-04  0.096706 -0.991105 -0.187535 -0.620947
2013-01-05  0.182240  0.308173 -1.098751 -1.019735

Selecting values from a DataFrame where a boolean condition is met

In [63]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.125785  0.171231  0.074673       NaN
2013-01-02  1.351675  0.062906  0.054149       NaN
2013-01-03  0.928863  0.973710  0.959123       NaN
2013-01-04  0.096706       NaN       NaN       NaN
2013-01-05  0.182240  0.308173       NaN       NaN
2013-01-06       NaN       NaN  0.995095  0.596275

Using the isin() method for flitering

In [65]:
df2 = df.copy()

df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

df2

                   A         B         C         D      E
2013-01-01  0.125785  0.171231  0.074673 -0.304952    one
2013-01-02  1.351675  0.062906  0.054149 -1.593760    one
2013-01-03  0.928863  0.973710  0.959123 -0.764992    two
2013-01-04  0.096706 -0.991105 -0.187535 -0.620947  three
2013-01-05  0.182240  0.308173 -1.098751 -1.019735   four
2013-01-06 -0.104063 -0.124442  0.995095  0.596275  three

In [69]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.928863  0.973710  0.959123 -0.764992   two
2013-01-05  0.182240  0.308173 -1.098751 -1.019735  four

# Setting
Setting a new column automatically aligns the data by the indexes

In [72]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [74]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.125785  0.171231  0.074673 -0.304952  NaN
2013-01-02  1.351675  0.062906  0.054149 -1.593760  1.0
2013-01-03  0.928863  0.973710  0.959123 -0.764992  2.0
2013-01-04  0.096706 -0.991105 -0.187535 -0.620947  3.0
2013-01-05  0.182240  0.308173 -1.098751 -1.019735  4.0
2013-01-06 -0.104063 -0.124442  0.995095  0.596275  5.0

Setting values by label:

In [77]:
df.at[dates[0], 'A'] = 0

df

                   A         B         C         D    F
2013-01-01  0.000000  0.171231  0.074673 -0.304952  NaN
2013-01-02  1.351675  0.062906  0.054149 -1.593760  1.0
2013-01-03  0.928863  0.973710  0.959123 -0.764992  2.0
2013-01-04  0.096706 -0.991105 -0.187535 -0.620947  3.0
2013-01-05  0.182240  0.308173 -1.098751 -1.019735  4.0
2013-01-06 -0.104063 -0.124442  0.995095  0.596275  5.0

Setting values by position:

In [78]:
df.iat[0, 1] = 0

Setting by assigning with a NumPy array:

In [79]:
df.loc[:,'D'] = np.array(([5]) * len(df))

In [80]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.074673  5  NaN
2013-01-02  1.351675  0.062906  0.054149  5  1.0
2013-01-03  0.928863  0.973710  0.959123  5  2.0
2013-01-04  0.096706 -0.991105 -0.187535  5  3.0
2013-01-05  0.182240  0.308173 -1.098751  5  4.0
2013-01-06 -0.104063 -0.124442  0.995095  5  5.0

A _where_ operation with setting:

In [83]:
df2 = df.copy()

df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.074673 -5  NaN
2013-01-02 -1.351675 -0.062906 -0.054149 -5 -1.0
2013-01-03 -0.928863 -0.973710 -0.959123 -5 -2.0
2013-01-04 -0.096706 -0.991105 -0.187535 -5 -3.0
2013-01-05 -0.182240 -0.308173 -1.098751 -5 -4.0
2013-01-06 -0.104063 -0.124442 -0.995095 -5 -5.0

# Missing Data

Re-indexing allows you to change/add/elete the index on a specified axis. This returns a copy of the data

In [85]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  0.074673  5  NaN NaN
2013-01-02  1.351675  0.062906  0.054149  5  1.0 NaN
2013-01-03  0.928863  0.973710  0.959123  5  2.0 NaN
2013-01-04  0.096706 -0.991105 -0.187535  5  3.0 NaN

In [86]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.074673  5  NaN  1.0
2013-01-02  1.351675  0.062906  0.054149  5  1.0  1.0
2013-01-03  0.928863  0.973710  0.959123  5  2.0  NaN
2013-01-04  0.096706 -0.991105 -0.187535  5  3.0  NaN

To drop any rows that have missing data.

In [87]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.351675  0.062906  0.054149  5  1.0  1.0

Fill missing data:

In [88]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.074673  5  5.0  1.0
2013-01-02  1.351675  0.062906  0.054149  5  1.0  1.0
2013-01-03  0.928863  0.973710  0.959123  5  2.0  5.0
2013-01-04  0.096706 -0.991105 -0.187535  5  3.0  5.0

To get the boolean mask where values are _nan_

In [89]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True